vsfteam/vsf/source/hal/driver/ST/STM32H7/common/startup_STM32H7.c
/******************************************************************************
 * @file     startup_ARMCM7.c(modified for STM32H7)
 * @brief    CMSIS-Core(M) Device Startup File for a Cortex-M7 Device
 * @version  V2.0.0
 * @date     04. June 2019
 ******************************************************************************/
/*
 * Copyright (c) 2009-2019 Arm Limited. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include "../__device.h"

/*----------------------------------------------------------------------------
  Exception / Interrupt Handler Function Prototype
 *----------------------------------------------------------------------------*/
typedef void( *pFunc )( void );

/*----------------------------------------------------------------------------
  External References
 *----------------------------------------------------------------------------*/
extern uint32_t __INITIAL_SP;

extern __NO_RETURN void __PROGRAM_START(void);

/*----------------------------------------------------------------------------
  Internal References
 *----------------------------------------------------------------------------*/

void __NO_RETURN Reset_Handler  (void);

/*----------------------------------------------------------------------------
  Exception / Interrupt Handler
 *----------------------------------------------------------------------------*/
/* Exceptions */
WEAK(NMI_Handler)
void NMI_Handler            (void){}

WEAK(HardFault_Handler)
void HardFault_Handler      (void){while(1);}

WEAK(MemManage_Handler)
void MemManage_Handler      (void){while(1);}

WEAK(BusFault_Handler)
void BusFault_Handler       (void){while(1);}

WEAK(UsageFault_Handler)
void UsageFault_Handler     (void){while(1);}

WEAK(SVC_Handler)
void SVC_Handler            (void){}

WEAK(DebugMon_Handler)
void DebugMon_Handler       (void){}

WEAK(PendSV_Handler)
void PendSV_Handler         (void){}

WEAK(SysTick_Handler)
void SysTick_Handler        (void){}

WEAK(WWDG_IRQHandler)
void WWDG_IRQHandler        (void){}

WEAK(PVD_AVD_IRQHandler)
void PVD_AVD_IRQHandler     (void){}

WEAK(TAMP_STAMP_IRQHandler)
void TAMP_STAMP_IRQHandler  (void){}

WEAK(RTC_WKUP_IRQHandler)
void RTC_WKUP_IRQHandler    (void){}

WEAK(FLASH_IRQHandler)
void FLASH_IRQHandler       (void){}

WEAK(RCC_IRQHandler)
void RCC_IRQHandler         (void){}

WEAK(EXTI0_IRQHandler)
void EXTI0_IRQHandler       (void){}

WEAK(EXTI1_IRQHandler)
void EXTI1_IRQHandler       (void){}

WEAK(EXTI2_IRQHandler)
void EXTI2_IRQHandler       (void){}

WEAK(EXTI3_IRQHandler)
void EXTI3_IRQHandler       (void){}

WEAK(EXTI4_IRQHandler)
void EXTI4_IRQHandler       (void){}

WEAK(DMA1_Stream0_IRQHandler)
void DMA1_Stream0_IRQHandler(void){}

WEAK(DMA1_Stream1_IRQHandler)
void DMA1_Stream1_IRQHandler(void){}

WEAK(DMA1_Stream2_IRQHandler)
void DMA1_Stream2_IRQHandler(void){}

WEAK(DMA1_Stream3_IRQHandler)
void DMA1_Stream3_IRQHandler(void){}

WEAK(DMA1_Stream4_IRQHandler)
void DMA1_Stream4_IRQHandler(void){}

WEAK(DMA1_Stream5_IRQHandler)
void DMA1_Stream5_IRQHandler(void){}

WEAK(DMA1_Stream6_IRQHandler)
void DMA1_Stream6_IRQHandler(void){}

WEAK(ADC_IRQHandler)
void ADC_IRQHandler         (void){}

WEAK(FDCAN1_IT0_IRQHandler)
void FDCAN1_IT0_IRQHandler  (void){}

WEAK(FDCAN2_IT0_IRQHandler)
void FDCAN2_IT0_IRQHandler  (void){}

WEAK(FDCAN1_IT1_IRQHandler)
void FDCAN1_IT1_IRQHandler  (void){}

WEAK(FDCAN2_IT1_IRQHandler)
void FDCAN2_IT1_IRQHandler  (void){}

WEAK(EXTI9_5_IRQHandler)
void EXTI9_5_IRQHandler     (void){}

WEAK(TIM1_BRK_IRQHandler)
void TIM1_BRK_IRQHandler    (void){}

WEAK(TIM1_UP_IRQHandler)
void TIM1_UP_IRQHandler     (void){}

WEAK(TIM1_TRG_COM_IRQHandler)
void TIM1_TRG_COM_IRQHandler(void){}

WEAK(TIM1_CC_IRQHandler)
void TIM1_CC_IRQHandler     (void){}

WEAK(TIM2_IRQHandler)
void TIM2_IRQHandler        (void){}

WEAK(TIM3_IRQHandler)
void TIM3_IRQHandler        (void){}

WEAK(TIM4_IRQHandler)
void TIM4_IRQHandler        (void){}

WEAK(I2C1_EV_IRQHandler)
void I2C1_EV_IRQHandler     (void){}

WEAK(I2C1_ER_IRQHandler)
void I2C1_ER_IRQHandler     (void){}

WEAK(I2C2_EV_IRQHandler)
void I2C2_EV_IRQHandler     (void){}

WEAK(I2C2_ER_IRQHandler)
void I2C2_ER_IRQHandler     (void){}

WEAK(SPI1_IRQHandler)
void SPI1_IRQHandler        (void){}

WEAK(SPI2_IRQHandler)
void SPI2_IRQHandler        (void){}

WEAK(USART1_IRQHandler)
void USART1_IRQHandler      (void){}

WEAK(USART2_IRQHandler)
void USART2_IRQHandler      (void){}

WEAK(USART3_IRQHandler)
void USART3_IRQHandler      (void){}

WEAK(EXTI15_10_IRQHandler)
void EXTI15_10_IRQHandler   (void){}

WEAK(RTC_Alarm_IRQHandler)
void RTC_Alarm_IRQHandler   (void){}

WEAK(SWI0_IRQHandler)
void SWI0_IRQHandler        (void){}

WEAK(TIM8_BRK_TIM12_IRQHandler)
void TIM8_BRK_TIM12_IRQHandler(void){}

WEAK(TIM8_UP_TIM13_IRQHandler)
void TIM8_UP_TIM13_IRQHandler(void){}

WEAK(TIM8_TRG_COM_TIM14_IRQHandler)
void TIM8_TRG_COM_TIM14_IRQHandler(void){}

WEAK(TIM8_CC_IRQHandler)
void TIM8_CC_IRQHandler(void){}

WEAK(DMA1_Stream7_IRQHandler)
void DMA1_Stream7_IRQHandler(void){}

WEAK(FMC_IRQHandler)
void FMC_IRQHandler         (void){}

WEAK(SDMMC1_IRQHandler)
void SDMMC1_IRQHandler      (void){}

WEAK(TIM5_IRQHandler)
void TIM5_IRQHandler        (void){}

