vsfteam/vsf/source/hal/driver/ST/STM32H7/common/startup_STM32H7.c
WEAK(SPI3_IRQHandler)
void SPI3_IRQHandler        (void){}

WEAK(UART4_IRQHandler)
void UART4_IRQHandler       (void){}

WEAK(UART5_IRQHandler)
void UART5_IRQHandler       (void){}

WEAK(TIM6_DAC_IRQHandler)
void TIM6_DAC_IRQHandler    (void){}

WEAK(TIM7_IRQHandler)
void TIM7_IRQHandler        (void){}

WEAK(DMA2_Stream0_IRQHandler)
void DMA2_Stream0_IRQHandler(void){}

WEAK(DMA2_Stream1_IRQHandler)
void DMA2_Stream1_IRQHandler(void){}

WEAK(DMA2_Stream2_IRQHandler)
void DMA2_Stream2_IRQHandler(void){}

WEAK(DMA2_Stream3_IRQHandler)
void DMA2_Stream3_IRQHandler(void){}

WEAK(DMA2_Stream4_IRQHandler)
void DMA2_Stream4_IRQHandler(void){}

WEAK(ETH_IRQHandler)
void ETH_IRQHandler         (void){}

WEAK(ETH_WKUP_IRQHandler)
void ETH_WKUP_IRQHandler    (void){}

WEAK(FDCAN_CAL_IRQHandler)
void FDCAN_CAL_IRQHandler   (void){}

WEAK(CM7_SEV_IRQHandler)
void CM7_SEV_IRQHandler     (void){}

WEAK(CM4_SEV_IRQHandler)
void CM4_SEV_IRQHandler     (void){}

WEAK(SWI1_IRQHandler)
void SWI1_IRQHandler        (void){}

WEAK(SWI2_IRQHandler)
void SWI2_IRQHandler        (void){}

WEAK(DMA2_Stream5_IRQHandler)
void DMA2_Stream5_IRQHandler(void){}

WEAK(DMA2_Stream6_IRQHandler)
void DMA2_Stream6_IRQHandler(void){}

WEAK(DMA2_Stream7_IRQHandler)
void DMA2_Stream7_IRQHandler(void){}

WEAK(USART6_IRQHandler)
void USART6_IRQHandler      (void){}

WEAK(I2C3_EV_IRQHandler)
void I2C3_EV_IRQHandler     (void){}

WEAK(I2C3_ER_IRQHandler)
void I2C3_ER_IRQHandler     (void){}

WEAK(OTG_HS_EP1_OUT_IRQHandler)
void OTG_HS_EP1_OUT_IRQHandler(void){}

WEAK(OTG_HS_EP1_IN_IRQHandler)
void OTG_HS_EP1_IN_IRQHandler(void){}

WEAK(OTG_HS_WKUP_IRQHandler)
void OTG_HS_WKUP_IRQHandler (void){}

WEAK(OTG_HS_IRQHandler)
void OTG_HS_IRQHandler      (void){}

WEAK(DCMI_IRQHandler)
void DCMI_IRQHandler        (void){}

WEAK(CRYP_IRQHandler)
void CRYP_IRQHandler        (void){}

WEAK(HASH_RNG_IRQHandler)
void HASH_RNG_IRQHandler    (void){}

WEAK(FPU_IRQHandler)
void FPU_IRQHandler         (void){}

WEAK(UART7_IRQHandler)
void UART7_IRQHandler       (void){}

WEAK(UART8_IRQHandler)
void UART8_IRQHandler       (void){}

WEAK(SPI4_IRQHandler)
void SPI4_IRQHandler        (void){}

WEAK(SPI5_IRQHandler)
void SPI5_IRQHandler        (void){}

WEAK(SPI6_IRQHandler)
void SPI6_IRQHandler        (void){}

WEAK(SAI1_IRQHandler)
void SAI1_IRQHandler        (void){}

WEAK(LTDC_IRQHandler)
void LTDC_IRQHandler        (void){}

WEAK(LTDC_ER_IRQHandler)
void LTDC_ER_IRQHandler     (void){}

WEAK(DMA2D_IRQHandler)
void DMA2D_IRQHandler       (void){}

WEAK(SAI2_IRQHandler)
void SAI2_IRQHandler        (void){}

WEAK(QUADSPI_IRQHandler)
void QUADSPI_IRQHandler     (void){}

WEAK(LPTIM1_IRQHandler)
void LPTIM1_IRQHandler      (void){}

WEAK(CEC_IRQHandler)
void CEC_IRQHandler         (void){}

WEAK(I2C4_EV_IRQHandler)
void I2C4_EV_IRQHandler     (void){}

WEAK(I2C4_ER_IRQHandler)
void I2C4_ER_IRQHandler     (void){}

WEAK(SPDIF_RX_IRQHandler)
void SPDIF_RX_IRQHandler    (void){}

WEAK(OTG_FS_EP1_OUT_IRQHandler)
void OTG_FS_EP1_OUT_IRQHandler(void){}

WEAK(OTG_FS_EP1_IN_IRQHandler)
void OTG_FS_EP1_IN_IRQHandler(void){}

WEAK(OTG_FS_WKUP_IRQHandler)
void OTG_FS_WKUP_IRQHandler (void){}

WEAK(OTG_FS_IRQHandler)
void OTG_FS_IRQHandler      (void){}

WEAK(DMAMUX1_OVR_IRQHandler)
void DMAMUX1_OVR_IRQHandler (void){}

WEAK(HRTIM1_Master_IRQHandler)
void HRTIM1_Master_IRQHandler(void){}

WEAK(HRTIM1_TIMA_IRQHandler)
void HRTIM1_TIMA_IRQHandler (void){}

WEAK(HRTIM1_TIMB_IRQHandler)
void HRTIM1_TIMB_IRQHandler (void){}

WEAK(HRTIM1_TIMC_IRQHandler)
void HRTIM1_TIMC_IRQHandler (void){}

WEAK(HRTIM1_TIMD_IRQHandler)
void HRTIM1_TIMD_IRQHandler (void){}

WEAK(HRTIM1_TIME_IRQHandler)
void HRTIM1_TIME_IRQHandler (void){}

WEAK(HRTIM1_FLT_IRQHandler)
void HRTIM1_FLT_IRQHandler  (void){}

WEAK(DFSDM1_FLT0_IRQHandler)
void DFSDM1_FLT0_IRQHandler (void){}

WEAK(DFSDM1_FLT1_IRQHandler)
void DFSDM1_FLT1_IRQHandler (void){}

WEAK(DFSDM1_FLT2_IRQHandler)
void DFSDM1_FLT2_IRQHandler (void){}

WEAK(DFSDM1_FLT3_IRQHandler)
void DFSDM1_FLT3_IRQHandler (void){}

WEAK(SAI3_IRQHandler)
void SAI3_IRQHandler        (void){}

WEAK(SWPMI1_IRQHandler)
void SWPMI1_IRQHandler      (void){}

WEAK(TIM15_IRQHandler)
void TIM15_IRQHandler       (void){}

WEAK(TIM16_IRQHandler)
void TIM16_IRQHandler       (void){}

WEAK(TIM17_IRQHandler)
void TIM17_IRQHandler       (void){}

WEAK(MDIOS_WKUP_IRQHandler)
void MDIOS_WKUP_IRQHandler  (void){}

WEAK(MDIOS_IRQHandler)
void MDIOS_IRQHandler       (void){}

WEAK(JPEG_IRQHandler)
void JPEG_IRQHandler        (void){}

WEAK(MDMA_IRQHandler)
void MDMA_IRQHandler        (void){}

WEAK(DSI_IRQHandler)
void DSI_IRQHandler         (void){}

WEAK(SDMMC2_IRQHandler)
void SDMMC2_IRQHandler      (void){}

WEAK(HSEM1_IRQHandler)
void HSEM1_IRQHandler       (void){}

WEAK(HSEM2_IRQHandler)
void HSEM2_IRQHandler       (void){}

WEAK(ADC3_IRQHandler)
void ADC3_IRQHandler        (void){}

WEAK(DMAMUX2_OVR_IRQHandler)
void DMAMUX2_OVR_IRQHandler (void){}

WEAK(BDMA_Channel0_IRQHandler)
void BDMA_Channel0_IRQHandler(void){}

WEAK(BDMA_Channel1_IRQHandler)
void BDMA_Channel1_IRQHandler(void){}

WEAK(BDMA_Channel2_IRQHandler)
void BDMA_Channel2_IRQHandler(void){}

WEAK(BDMA_Channel3_IRQHandler)
void BDMA_Channel3_IRQHandler(void){}

WEAK(BDMA_Channel4_IRQHandler)
void BDMA_Channel4_IRQHandler(void){}

WEAK(BDMA_Channel5_IRQHandler)
void BDMA_Channel5_IRQHandler(void){}

WEAK(BDMA_Channel6_IRQHandler)
void BDMA_Channel6_IRQHandler(void){}

WEAK(BDMA_Channel7_IRQHandler)
void BDMA_Channel7_IRQHandler(void){}

WEAK(COMP1_IRQHandler)
void COMP1_IRQHandler       (void){}

WEAK(LPTIM2_IRQHandler)
void LPTIM2_IRQHandler      (void){}

WEAK(LPTIM3_IRQHandler)
void LPTIM3_IRQHandler      (void){}

WEAK(LPTIM4_IRQHandler)
void LPTIM4_IRQHandler      (void){}

